#
# 2023年1月31日 bianpeng
#

# 配置信息
class ConfigMgr:
    def __init__(self):
        pass

_city_name_data = [
'洛阳','建业','成都','汉中','南皮','北平','武威','天水',
'庐江','会稽','江陵','长沙','零陵','桂阳','建宁','云南',
'西平','长安','宛城','许昌','小沛','下邳','武陵','江洲',
'陈留','平原','新野','襄阳','濮阳','河东','平阳','河内',
'弘农','涿郡','代郡','渔阳','上谷','辽西','玄菟','乐浪',
'白帝','燕国','辽东','魏郡','广平','钜鹿','常山','博陵',
'渤海','河间','清河','赵国','中山','太原','上党','乐平',
'西河','雁门','新兴','济南','乐安','北海','城阳','东莱',
'平原','东郡','济阴','山阳','泰山','济北','寿春','任城',
'东平','颍川','汝南','弋阳','陈郡','谯郡','鲁郡','梁国',
'沛国','彭城','下邳','东海','琅琊','东莞','广陵','京兆',
'冯翊','扶风','北地','新平','陇西','天水','南安','广魏',
'安定','武都','阴平','金城','西平','武威','张掖','酒泉',
'敦煌','西海','南阳','南乡','江夏','襄阳','南郡','武陵',
'长沙','零陵','贵阳','蜀郡','犍为','朱提','越隽','牂柯',
'建宁','永昌','汉中','广汉','梓潼','巴郡','巴西','巴东',
'九江','庐江','丹阳','会稽','建安','吴郡','豫章','庐陵',
'交趾','九真','日南','南海','苍梧','合蒲','珠崖','柴桑'
'永安',
]

def new_city_name():
    if len(_city_name_data) > 0:
        return _city_name_data.pop()
    else:
        return '新城'

